app/controllers/students_controller.rb

INSERT INTO "students" ("age", "created_at", "name", "subject", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["age", 22], ["created_at", Fri, 07 Mar 2014 18:34:17 UTC +00:00], ["name", "George Powell"], ["subject", "CS"], ["updated_at", Fri, 07 Mar 2014 18:34:17 UTC +00:00]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "age" = $1, "updated_at" = $2 WHERE "students"."id" = 1  [["age", 23], ["updated_at", Sun, 09 Mar 2014 17:43:14 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)